// - Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
// //     Також потрібно врахувати коли введені рівні числа.
// let a = +prompt('Введіть число');
// let b = +prompt('Введіть число');
// if (a > b) {
//     console.log(a);
// } else if (b > a) {
//     console.log(b);
// } else if (b === a) {
//     console.log('Числа рівні');
// }
// //
// //
// // - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// // Користувач вводить номер квартири просто в змінні або через prompt('') .
// //     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.
// //
// let dom = +prompt('Введіть номер квартіри')
// dom = 90;
// if (dom > 0 && dom < 21) {
//     console.log('перший підїзд')
// } else if (dom > 20 && dom < 49) {
//     console.log('другий підїзд')
// } else if (dom > 48 && dom < 91) {
//     console.log('другий підїзд')
// }
//
// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО
//
// let number = 10;
// if (number === 10) {
//     console.log('ВІРНО')
// } else if (number != 10) {
//     console.log('НЕВІРНО')
// }
// - Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
//     якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else
//

let n = "hhujhujk";

if (typeof n === 'number') {
    console.log('1')

} else  if  (typeof n === 'string') {
    console.log('2')
} else if (typeof n === 'boolean')
{
    console.log('3');

} else if (typeof n === 'object')
{
    console.log('3');
} else if (typeof n === 'undefined')
{
    console.log('Другие');
}

//
// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН
let student =+prompt('чи ми йдемо сьогодні в OKTEN на навчання?')
if ( student <23 && student>10)
    alert("ми йдемо ВЧИТИСЯ")
else {
    alert('сидимо вдома і вчимося ОНЛАЙН')
}
//
//
// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .

let week = "";
switch (week) {

    case "1":
        console.log("Авто");
        break;
    case "2":
        console.log("Мото");
        break;
    case "3":
        console.log("Телефон");
        break;
    case "":
        console.log("число не вірне");
        break;
}