// Всі функції повинні бути описані стрілочним типом!!!!
//     - створити функцію яка приймає три числа та виводить найменьше. (Без Math.min!)



////////
let listCreator = (a,b,c) => {
    if (a < b && a < c) {
        document.write(a)
    }
    if (b < c && b < a) {
        document.write(b)
    }
    if (c < a && c < b) {
        document.write(c)
    }
}
listCreator(6, 66, 666);
// - створити функцію яка приймає три числа та виводить найбільше. (Без Math.max!)
let listCreator44 = (a,b,c) => {
    if (a > b && a > c) {
        document.write(a)
    }
    if (b > c && b > a) {
        document.write(b)
    }
    if (c > a && c > b) {
        document.write(c)
    }
}
listCreator44(6, 66, 1666);


    //////////

// - створити функцію яка повертає найбільше число з масиву
let listCreator33 =( let = mass [1, 5, 6, 88, 8778, 88, 2, 0, -12, 665656]) => {
    let max = mass[0]
    for (let i = 0; i < mass.length; i++) {
        if (mass[i] > max) {
            max = mass[i]
        }
    }
    return max
}
let maximalnoe = listCreator33(mass)
console.log(maximalnoe);

// - створити функцію яка повертає найменьше число з масиву

// - створити функцію яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад [1,2,10]->13

// - створити функцію яка приймає масив чисел та повертає середнє арифметичне його значень.

// - створити функцію яка приймає будь-яку кількість чисел, повертає найменьше, а виводить найбільше (Math використовувати заборонено);

// - створити функцію яка заповнює масив рандомними числами

// (цей код генерує рандомні числа в діапазоні від 0 до 100 - Math.round(Math.random()*100)) та виводить його.

// - створити функцію яка заповнює масив рандомними числами в діапазоні від 0 до limit. limit - аргумент, який характеризує кінцеве значення діапазону.

// - Функція приймає масив та робить з нього новий масив в зворотньому порядку. [1,2,3] -> [3, 2, 1].
